---
kind: method
id: M:Autodesk.Revit.DB.ExternalResourceReference.Dispose
source: html/d550b72c-00fd-18e9-c345-721f08a67c4c.htm
---
# Autodesk.Revit.DB.ExternalResourceReference.Dispose Method

Releases all resources used by the ExternalResourceReference

## Syntax (C#)
```csharp
public void Dispose()
```